import 'package:flutter/material.dart';
import 'package:varnaboomapp/Detail.dart';
import 'package:sizer/sizer.dart';

class protocol extends StatelessWidget {
  const protocol({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: GestureDetector(
          child: Icon(Icons.arrow_back_ios_new),
          onTap: () => Navigator.pop(context),
        ),
        centerTitle: true,
        automaticallyImplyLeading: false,
        title: Image(
          image: AssetImage('assets/image/logo2.png'),
          fit: BoxFit.cover,
          height: 30.h,
          width: 30.w,
          color: Colors.white,
        ),

        // Image(image: AssetImage('assets/image/logo2.png'))

        backgroundColor: primaryColor,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.only(left: 20, right: 20),
          child: Text(
            """ 

            
به وارنابوم خوش آمدید

اپلیکیشن وارنابوم برای معرفی اصناف ورامین، قرچک، پیشوا و جوادآباد و به منظور دسترسی آسان شهروندان به صنوف مختلف طراحی شده است. این اپلیکیشن به مخاطبان عزیز این امکان را می دهد که حتی المقدور با ویژگی های اصناف مختلف اعم از شماره تماس، موقعیت مکانی، آدرس شبکه های اجتماعی ، تبلیغات ویدئویی و محصولات ارائه شده توسط اصناف این 4 شهرستان به منظور شناخت هر چه بهتر آشنا شوند

دریافت خدمات از اپلیکیشن وارنابوم در گرو رعایت کردن شرایط و قوانین وارنابوم است. وارنابوم در چارچوب ماده 10 قانون مدنی ، این شرایط و قوانین را با کاربران خود در میان میگذارد و موافقت الزام آور کاربران با مفاد آن را کسب می کند. لطفا قبل از استفاده از خدمات وارنابوم این شرایط و قوانین را مطالعه کنید

بدیهی است که استفاده از اپلیکیشن وارنابوم به معنی پذیرفتن کامل این شرایط و قوانین است. در نظر داشته باشید که در صورت بروز هرگونه اختلاف میان شما و وارنابوم، حقوق و تعهدات طرفین بر اساس مفادی که در ادامه می‌خوانید، تعیین می شود. در زمان اختلاف، ادعای ناآگاهی و عدم اطلاع از شرایط و قوانین وارنابوم قابل قبول نخواهد بود

:ماده 1: شرایط عمومی استفاده از وارنابوم

م1-1 به منظور جلوگیری از ورود ربات ها و... در ابتدا شماره موبایل کاربر می بایست در اپلیکیشن ثبت شود. از همین رو یک پیامک از شمارهی 98300077 به منظور کدتایید ارسال می شود. پس از درج کد در قسمت معین شده، امکان دسترسی به محتوای وارنابوم برای شما فراهم می گردد

م1-2 شماره تماس کاربران تنها به منظور ارسال کد تایید به منظور ورود به اپلیکیشن، ارسال پیام هایی مرتبط با اپلیکیشن وارنابوم، ارسال پیام هایی با اهداف اپلیکیشن که همان معرفی اصناف و دستیابی به شناخت بهتر صنوف این 4شهرستان می باشد ارسال می گردد

م1-3 هر فرد به محض ثبت نام در اپلیکیشن وارنابوم از طریق شماره ی تلفن همراه خود، صراحتاً موافقتش را با ذخیره‌سازی قانونی اطلاعات شخصی خود و استفاده و محافظت از این اطلاعات، اعلام می‌دارد

:ماده2: شرایط ثبت صنف و آگهی در وارنابوم

م2-1 عدم مغایرت فعالیت کاربر یا آگهی‌های او با قوانین، مقررات، آیین‌نامه‌ها، بخشنامه‌ها، مصوبات، دستورالعمل‌های جاری جمهوری اسلامی ایران، دستورات مقامات قضایی، عرف و نظم عمومی

م2-2 عدم مغایرت فعالیت کاربر یا آگهی‌های او با شرایط و قوانین مندرج در اپلیکیشن وارنابوم.

م2-3  وارنابوم هیچگونه مسئولیتی در قبال صحت و سقم معرفی اصناف اعم از تاییدِ دارا بودن مجوز رسمی کسب و کار، مطالب مندرج در معرفی صنف و محصولات ندارد

م2-4 وارنابوم هیچ گونه مسئولیتی در قبال خرید و فروش محصولی که از طریق وارنابوم معرفی شده است را ندارد

م2-5 هر کاربر خود مسئولیت صحت اطلاعات شخصی و محتوای مندرج در عنوان و متن آگهی‌اش را بر عهده دارد. وارنابوم در حدود امکانات و توانایی‌های موجود، حق احراز هویت کاربران و نظارت بر محتوای آگهی‌ها را برای خود محفوظ می‌داند، اما چنین نظارتی مغایر با مسئولیت نهایی کاربر نیست

م2-6 تمام محتواهایی که در اپلیکیشن وارنابوم درج می‌شود باید به زبان فارسی باشد

م2-7 بنای اصلی ایجاد وارنابوم بر محور تحکیم اصناف رسمی و مجوزدار می باشد. از همین رو وارنابوم میتواند در صورت ابلاغ نامه از سوی اتحادیهی تحت نظرِ صنفِ کاربر مبنی بر انقضای جواز کسب، صفحهی کاربر مورد نظر را مسدود نماید. همچنین در صورت پرداخت هرگونه وجه از سوی کاربر به وارنابوم، پس از انسداد فعالیت کاربر، وجه مورد نظر عودت داده نمی شود

م2-8 کاربر آگاه است که در صورتی که دارای مجوز رسمی از نهادهای مربوطه به منظور انجام کسب و کار است، در قسمت ثبت نام اصناف و درج آگهی اقدام به بارگذاری محتوا می نماید. در صورتی که وارنابوم متوجه عدم جواز کسب و کار شود، میتواند اقدام به مسدود سازی فعالیت کاربر نماید. لازم به ذکر است که فعالیت در بخش " کار خانگی" نیازمند هیچ گونه مجوزی نمی باشد

:ماده3: سیاست‌های انتشار آگهی و معرفی واحد صنفی

:م3-1 موارد ممنوعه برای انتشار آگهی در وارنابوم از این قرار است

ا·        انتشار هرگونه آگهی که خارج از قلمرو سرزمینی ایران و مغایر با قوانین نظام مقدس جمهوری اسلامی باشد
ا·       انتشار هرگونه آگهی که موضوع و محتوا و تصویر آن شامل چیزی‌ باشد که نگهداری و خرید و فروش آن در قلمرو سرزمینی ایران غیرقانونی است
ا·       انتشار هرگونه آگهی که موضوع و محتوا و تصویر آن در لیست کالاها و فعالیت‌های ممنوعه قرار دارد
ا·       انتشار آگهی تکراری
ا·       انتشار هرگونه آگهی‌ که شامل عباراتی غیرمرتبط با موضوع آگهی باشد
ا·       انتشار هرگونه آگهی که مضمون آن مستهجن و مبتذل و نامتعارف یا بر خلاف قوانین کشور باشد
ا·       انتشار هرگونه آگهی که شامل توهین‌ و نشر اکاذیب و افترا باشد و محتوای آن منجر به نقض حقوق مادی و معنوی شخص ثالث یا تعرض به اموال و دارایی او شود
ا·       انتشار هرگونه اگهی که در آن درج قیمت به طور صحیح و قابل فهم وارد نشده باشد
ا·       انتشار هرگونه آگهی با عنوان و محتوای نادرست و مبهم و گمراه‌کننده
ا·       انتشار هرگونه آگهی که موضوع و محتوای آن به تشخیص نهادهای تخصصی موقتاً دارای محدودیت یا ممنوعیت باشد
ا·       انتشار هرگونه آگهی که منجر به نفرت‌پراکنی یا بی‌احترامی به گروه‌های قومی و مذهبی و جنسیتی شود
ا·       انتشار هرگونه محتوایی که حقوق زنان، کودکان، سالمندان، مهاجران خارجی یا موارد مشابه را نقض کند

م3-2 لیست کالاها و فعالیت‌های غیرمجاز

لطفاً توجه داشته باشید که بیان مصادیق صرفاً جهت آشنایی کاربران با بخشی از کالاها و فعالیت‌های غیر مجاز است؛ بنابراین، صرف ذکر نشدن یکی از موارد غیرمجاز در بخش مصادیق، حق اعتراض برای کسی نخواهد ساخت و تمام این مصادیق غیر حصری هستند 

م3-3 وارنابوم می تواند اگهی هایی که بیش از 40روز از انتشار آنها گذشته را به منظور آزادسازی فضای سرور پاک نماید

ماده 4- پشتیبانی اپلیکیشن

م4-1 وارنابوم متعهد است در صورت بروز نقص در اپلیکیشن وارنابوم، در حدود امکانات و توانایی‌های خود برای رفع نقص و پشتیبانی فنی اقدام کند
م4-2 کاربران در صورت نیاز به پشتیبانی می‌توانند در تمام ساعات شبانه‌روز و ایام هفته به شماره واتساپ 09904060904پیام خود را ارسال نمایند تا در اسرع وقت به سوالات آنها پاسخ داده شود

 ماده 5حل و فصل اختلافات

:در صورت بروز هرگونه اختلاف بین کاربر و وارنابوم رعایت موارد زیر لازم است

م۱- کاربر موظف است حسب صلاحدید و درخواست وارنابوم در جلسات حضوری یا آنلاین شرکت کند

م۲- در مواردی که به صلاحدید وارنابوم نیاز به تشکیل جلسه حضوری یا آنلاین نیست، کاربر موظف است حداکثر همکاری را با تیم پشتیبانی وارنابوم داشته باشد


            """,
            textAlign: TextAlign.right,
            style: TextStyle(fontFamily: Myfont),
          ),
        ),
      ),
    );
  }
}
